/*
题目编号：Exp04-Enhance01,GJBook3-06-25
题目名称：规则形式构建集合
题目描述：
设整数集合 M 定义如下：
(1) 1∈M ；
(2) 若 x ∈M , 则 2x+1 ∈M , 3x+1 ∈M ；
(3) 没有别的整数属于集合 M 。
编程序按递增顺序生成并输出集合 M 的前n项
输入：一个正整数n（≤300）。
输出：按递增序列输出n个属于集合M的整数，各数间以一个西文空格间隔；最后一个数后无字符。
样例1:
输入：10
输出：1 3 4 7 9 10 13 15 19 21
样例2：
输入：1
输出：1
*/
#include <stdio.h>
int n, i, v, k; // n为输出数字数量，i为正在处理的数据编号，k为当前已有的数据数量
int a[801] = {0};
int main(void)
{
    a[0] = 1;
    scanf("%d", &n);
    for (i = 0, k = 0; k <= 800; i++, k += 2)
    {
        a[k + 1] = 2 * a[i] + 1;
        a[k + 2] = 3 * a[i] + 1;
    }
    for (i = 0; i <= 800; i++)
    {
        for (k = 1; k <= 800; k++)
        {
            if (a[k] > a[i])
            {
                v = a[k];
                a[k] = a[i];
                a[i] = v;
            }
        }
    }
    for (i = 1; i <= n; i++)
    {
        if (a[i] == a[i + 1])
        {
            i++;
            n++;
        }
        printf("%d", a[i]);
        if (i < n)
        {
            printf(" ");
        }
    }
}