/*
题目编号：Exp05-Basic03，GJBook3例-07-01
题目名称：排序二维数组
题目描述：编写程序对输入的二维整型矩阵进行递增排序。
输入：第一行输入两个正整数n和m （n, m<=50）分别对应矩阵的行数和列数。随后n行，每行输入m个整数，每个整数间以空格间隔。
输出：排序后的矩阵：共n行，每行m个整数，之间以一个西文空格间隔，每行最后一个数字后除必要的回车换行符无其它字符，最后一行末尾无任何多余字符。
样例：
输入：
2 3
9 6 5
1 2 3
输出：
1 2 3
5 6 9
*/
#include <stdio.h>
int m, n, t;
int a[2500];
int i, j, k, v;
int main(void)
{
    scanf("%d%d", &m, &n);
    t = m * n;
    for (i = 0; i < t; i++)
    {
        scanf("%d", &a[i]);
    }
    for (i = 0; i < t - 1; i++)
    {
        for (k = 0; k < t - 1; k++)
        {
            if (a[k] > a[k + 1])
            {
                v = a[k];
                a[k] = a[k + 1];
                a[k + 1] = v;
            }
        }
    }
    for (i = 0; i < t; i++)
    {
        printf("%d", a[i]);
        if (i % n != (n - 1))
            printf(" ");
        if (i % n == (n - 1) && i != t - 1)
        {
            printf("\n");
        }
    }
}