/*
问题描述：设整数集合 M 定义如下：1∈M；若x∈M , 则2x+1∈M , 3x+1∈M；没有别的整数属于集合 M。编程序按递增顺序生成并输出集合M的无重复的前n(n<50)项。
 输入：一个整数n
 输出：n个无重复的递增整数，整数之间以一个西文空格间隔，最后一个整数后无多余字符。
 样例：输入3  输出1 3 4
时间限制：500ms内存限制：32000kb
*/
#include <stdio.h>
int n, i, v, k; // n为输出数字数量，i为正在处理的数据编号，k为当前已有的数据数量
int a[1000] = {0};
int main(void)
{
    a[0] = 1;
    scanf("%d", &n);
    for (i = 0, k = 0; k <= 999; i++, k += 2)
    {
        a[k + 1] = 2 * a[i] + 1;
        a[k + 2] = 3 * a[i] + 1;
    }
    for (i = 0; i <= 999; i++)
    {
        for (k = 1; k <= 998; k++)
        {
            if (a[k] > a[i])
            {
                v = a[k];
                a[k] = a[i];
                a[i] = v;
            }
        }
    }
    for (i = 1; i <= n; i++)
    {
        if (a[i] == a[i + 1])
        {
            i++;
            n++;
        }
        printf("%d", a[i]);
        if (i < n)
        {
            printf(" ");
        }
    }
}